

## 1 物理层

### 1.1信号：信息传递的媒介
信号的分类：
模拟信号：连续变化的物理量。
数字信号：不连续的物理量，信号参数也不连续变化，高低固定。
数字信号的优势：抗干扰能力强，适合远距离传输并能保证质量
### 1.2 接口

```bash
以太网接口：
RJ-45水晶头
光纤接口：
FC 、ST、SC 
LC 窄体方形光纤接头（目前主流）
MT-RJ
```

### 1.3 双绞线
1）双绞线分类：

```bash
屏蔽双绞线（STP）
线外包裹一层金属网膜，用于电磁环境非常复杂的工业环境中 
非屏蔽双绞线（UTP）
```

2）双绞线标准与分类：

```bash
Cat5五类双绞线，传输频率为100MHz，适用于100Mbps的网络
Cat 5e衰减更小，串扰更少，性能优于5类线（超五类）
Cat 6传输频率为200MHz
Cat 7传输频率为600MHz
```

### 1.4 双绞线的连接规范
1）线序

```bash
T568A：
白绿、绿、白橙、蓝、白蓝、橙、白棕、棕
T568B：
白橙、橙、白绿、蓝、白蓝、绿、白棕、棕
1、2发送,3、6接收
```

2）线缆的连接：

```bash
标准网线（直连线或直通线）：用于连接不同设备（A-A，B-B）
交叉网线：用于连接相同设备（A-B）
全反线：不用于以太网的连接，主要用于计算机的串口和路由器或交换机的console（控制口）相连，它的线序是一端为1~8，另一端为8~1。
特例：计算机直接连接路由器用交叉线 交换机与交换机相连使用交叉或直连线一般用交叉线  
```

### 1.5 物理层设备

```bash
网卡
中继器
集线器
```

## 2 交换机
### 2.1 思科交换机的2种配置途径：

 - 1.使用交换机自带的`Console线缆`连接到`计算机的COM口`，然后利用计算机的超级终端软件直接配置，首次配置通常使用这种方式；
 - 2。通过`telnet方式`远程访问、配置交换机，这种方式要求此`交换机已配置有IP地址`且已接入计算机网络，后续课程会学习此访问方式。

1）通过超级终端访问交换机

![这里写图片描述](https://imgconvert.csdnimg.cn/aHR0cDovL2ltZy5ibG9nLmNzZG4ubmV0LzIwMTcwOTA3MDkwOTExOTI4?x-oss-process=image/format,png)

本例中的配置练习可采用思科模拟器 —— Cisco Packet Tracer 6.2来实现。

### 2.2 安装Packet Tracer 6.2

双击安装包执行默认安装，然后将中文语言文件Chinese.ptl解压到安装目录下的多语言文件夹，比如C:\Program Files (x86)\Cisco Packet Tracer 6.0\languages。

双击桌面的Cisco Packet Tracer快捷方式以启动程序，打开菜单“Options”-->“Preferences”-->切换到“Interface”选项卡-->选择下方的Chinese.ptl-->单击右下角“Change Language”按钮，弹出提示时单击“OK”，如图-11所示。

![这里写图片描述](https://imgconvert.csdnimg.cn/aHR0cDovL2ltZy5ibG9nLmNzZG4ubmV0LzIwMTcwOTA3MDkwOTQ0MjAx?x-oss-process=image/format,png)
图－11

关闭当前Packet Tracer程序，然后再重新启动此程序，可发现已经变成中文语言界面了（当前汉化的还不完整），如图-12所示。

![这里写图片描述](https://imgconvert.csdnimg.cn/aHR0cDovL2ltZy5ibG9nLmNzZG4ubmV0LzIwMTcwOTA3MDkxMTA2MzU0?x-oss-process=image/format,png)
图－12

### 2.3 建立实验网络拓扑

在Packet Tracer程序主窗口中，添加一台Cisco 2960交换机、一台普通PC机，并添加Console连接、直通网线连接，如图-13所示，确认完毕后将当前拓扑结构保存为c2960-pc.pkt文件。

![这里写图片描述](https://imgconvert.csdnimg.cn/aHR0cDovL2ltZy5ibG9nLmNzZG4ubmV0LzIwMTcwOTA3MDkxMTI5MTg2?x-oss-process=image/format,png)

图－13

其中，连接细节如下：

    交换机的Console口 <--> PC机的RS 232串口。
    交换机的FastEthernet0/24接口 <--> PC机的FastEthernet0网卡。

### 2.4 配置步骤

实现此案例需要按照如下步骤进行。

步骤一：通过超级终端访问交换机。

1）配置并打开超级终端

在此前建立的Packet Tracer实验拓扑环境中，单击PC机以打开此设备，确认电源已启动（机箱示意图上的指示灯为黄绿色），切换到“桌面选项卡”，如图-14所示，找到其中的“终端”并单击打开。

![这里写图片描述](https://imgconvert.csdnimg.cn/aHR0cDovL2ltZy5ibG9nLmNzZG4ubmV0LzIwMTcwOTA3MDkxMTUyNDQy?x-oss-process=image/format,png)
图－14

在弹出的终端配置窗口中，如图-15所示，单击“确定”以接受默认值。

![这里写图片描述](https://imgconvert.csdnimg.cn/aHR0cDovL2ltZy5ibG9nLmNzZG4ubmV0LzIwMTcwOTA3MDkxMjA4NzA1?x-oss-process=image/format,png)
图－15

接下来就可以看到“终端”窗口了，其中显示了通过Console线连接的交换机初始化信息，回车后可进入交换机的“Switch>”配置系统，如图-16所示。

![这里写图片描述](https://imgconvert.csdnimg.cn/aHR0cDovL2ltZy5ibG9nLmNzZG4ubmV0LzIwMTcwOTA3MDkxMjIxMjM2?x-oss-process=image/format,png)
图－16

提示：在Packet Tracer环境中，可直接单击交换机图标，然后切换到“命令行”选项卡，也可以进入IOS配置环境。


### 2.5 交换机命令
工作模式：

```c
Switch>用户模式
Switch>enable
Switch#特权模式
Switch#configure terminal
Switch(config)#全局配置模式
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#接口模式
exit返回上一模式
end直接退到特权模式
常用命令：
Switch(config)#hostnameS1修改主机名为S1
Switch#show running-config查看配置信息
Switch#show version查看IOS版本信息
配置enable明文口令
全局配置模式：enable  password  123 
配置enable加密口令
全局配置模式： enable  secret  456
配置Console口令
全局模式：line  console  0
password  789
Login
保存交换机的配置
特权： copy  running-config  startup-config
或 write
恢复设备出厂默认值
特权：erase  startup-config
reload
设备配置的准备工作
空闲一段时间后，重回初始界面的问题
switch(config)#line con 0
switch(config-if)#exec-timeout 0 0
控制台消息打断输入的处理
switch(config)#line con 0
switch(config-if)#logging synchronous
禁用DNS查询
switch(config)#no ip domain-lookup
接口模式：shutdown禁用此接口
```


